[
  {
    "image": "https://img.icons8.com/color/256/task.png",
    "title": "TaskMaster Pro",
    "companyName": "NextGen Apps",
    "id": 1,
    "description": "TaskMaster Pro is a comprehensive task management and productivity application designed to help individuals and teams organize work, reduce cognitive load, and complete projects with confidence. The app blends fundamental to-do list functionality with advanced scheduling, intelligent reminders, and contextual collaboration tools. Users can create nested projects and tasks, attach rich media and notes, set recurring schedules, and add priority tags and custom metadata. The heart of TaskMaster Pro is its adaptive reminder engine which analyzes a user’s historical completion patterns and suggests optimal times to surface tasks. Built-in collaboration features allow tasks to be assigned to team members, with threaded comments and activity history for each item so accountability remains clear and traceable. TaskMaster Pro integrates with calendars and email so that deadlines and meeting-driven tasks are automatically suggested for creation. The app offers a focus mode that temporarily hides non-urgent items, and a daily sprint view that surfaces the three most impactful actions to finish that day. For power users there are custom filters, saved smart views, keyboard shortcuts, and bulk editing. The app supports offline use with seamless sync when online and provides end-to-end encryption for sensitive notes. Onboarding includes a short interactive tour and best-practice templates (personal planning, sprint backlog, event planning, and habit-building). Accessibility considerations include high-contrast themes, scalable fonts, and screen‑reader labels. Developers maintain a public roadmap and release notes to keep users informed. Monetization uses a generous free tier with local features and a paid subscription that unlocks team workspaces, advanced automations, and priority support. TaskMaster Pro is suited to students managing coursework, freelancers juggling clients, families coordinating chores and shopping, and teams tracking releases. The app balances simplicity for quick capture with depth for scaling workflows across months and complex projects, helping users reduce mental clutter and consistently finish what matters most.",
    "size": 18,
    "reviews": 12000,
    "ratingAvg": 4.5,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 7200 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/1219/1219034.png",
    "title": "FitTrack",
    "companyName": "Wellness Co.",
    "id": 2,
    "description": "FitTrack is a holistic health and fitness tracker engineered to make daily wellbeing actionable and approachable. The app collects and integrates multiple data streams including manual exercise logs, step counts, heart-rate summaries, sleep patterns, and nutrition entries to produce coherent weekly insights rather than isolated metrics. FitTrack’s coaching engine offers personalized suggestions: adaptive workout plans that scale intensity based on recovery, nutrition prompts tailored to macro targets, and sleep hygiene tips responding to recent patterns. A visual timeline helps users correlate energy, workouts, and meals so they can observe what actually impacts performance. The app supports guided audio workouts, short mobility breaks, and breathing exercises for stress management. Social features let users create private groups for accountability and friendly challenges while privacy controls allow health data to remain local or shared selectively. For beginners, FitTrack includes short tutorials on exercise technique and simple meal prep ideas. For experienced users, it supports exporting data in standard formats and offers custom metrics and tags. Notifications are deliberately non-intrusive and configurable, with a gentle coaching tone rather than alarmist messaging. Accessibility is prioritized with voice-guided sessions and contrast options. FitTrack’s free tier covers core tracking; a premium subscription unlocks AI-driven meal plans, advanced sleep analytics, and one-on-one coaching credits. The design emphasizes small, consistent habit formation; measurable micro‑wins and reflective weekly reviews help users build momentum. FitTrack is suitable for people who want to improve general health, athletes refining training load, or anyone who needs a practical, evidence-informed companion that turns disparate health signals into usable daily actions.",
    "size": 27,
    "reviews": 8500,
    "ratingAvg": 4.2,
    "downloads": 350000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3800 }
    ]
  },
  {
    "image": "https://cdn-icons-png.flaticon.com/256/2920/2920244.png",
    "title": "PhotoSnap",
    "companyName": "PixelWorks",
    "id": 3,
    "description": "PhotoSnap is a lightweight but powerful mobile photo editor focused on quick, high-quality edits and share-ready results. The app provides a curated set of tools that cover the most common editing needs: one-tap auto-enhance, exposure contrast adjustments, color grading presets, selective blur, and a healing brush for blemish removal. PhotoSnap’s strength is in combining speed with subtlety — presets are designed to enhance photos rather than overhaul them, and sliders offer fine-grained control when needed. Users can compose multi-layer collages, add styled text overlays, and batch-apply adjustments across a set of images for consistent results. The app contains an array of export options including high-quality PNG/JPEG, social-ready aspect ratios, and size-optimized export for sharing or saving storage. PhotoSnap supports non-destructive editing so original files remain intact. For creators there are advanced RGB curves, split-tone controls, and an HSL panel for precise color manipulation. An integrated library helps users organize photos with tags, albums, and simple search. Tutorials and guided tooltips reduce the learning curve for newcomers. With privacy in mind PhotoSnap processes edits locally; cloud sync is available as an opt-in feature for cross-device continuity. The free tier includes core editing features and a sample preset pack; a premium subscription unlocks the full professional preset library, RAW processing, and priority support. PhotoSnap is ideal for casual photographers who want better-than-automatic results without spending time in complex desktop applications, as well as influencers and hobbyists who demand efficient mobile workflows.",
    "size": 34,
    "reviews": 22000,
    "ratingAvg": 4.7,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 13300 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/wallet--v1.png",
    "title": "BudgetBuddy",
    "companyName": "FinTech Labs",
    "id": 4,
    "description": "BudgetBuddy helps people take control of their personal finances with a friendly, no‑nonsense approach to budgeting, expense tracking, and goal-setting. The app starts with a simple onboarding that imports or guides users through common recurring expenses and income streams, then generates a suggested monthly budget categorized for needs, wants, and savings. Transactions can be added automatically via secure bank connections or entered manually, and BudgetBuddy provides smart categorization that learns from user corrections. Visual spending breakdowns, trend charts, and projected monthly balances help users anticipate shortfalls before they happen. The app also supports short-term saving goals (emergency fund, travel, device purchases) with auto-save rules that move small amounts on a schedule. Alerts notify users of upcoming bills, overspending in a category, and opportunities to accelerate savings. For debt management there are payoff planners with amortization visualizations and what-if scenarios to show how extra payments affect total interest. BudgetBuddy offers exporting options for budget data and privacy-first design: bank credentials use industry-standard encryption and no raw credentials are retained on our servers. The app provides educational micro-lessons about budgeting habits and includes templates for different financial philosophies (zero-sum, envelope, or percentage-based budgeting). A freemium model includes basic budgeting and manual tracking; premium adds account linking, multi-currency support, and personalized coaching insights. BudgetBuddy is aimed at people who want a practical tool to reduce money stress and make progress toward clear financial priorities.",
    "size": 22,
    "reviews": 6400,
    "ratingAvg": 4.3,
    "downloads": 280000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2700 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/language.png",
    "title": "LearnLang",
    "companyName": "EduTech Global",
    "id": 5,
    "description": "LearnLang is a language learning companion built around daily practice, spaced repetition, and real-usage conversational exercises. The app organizes learning into short micro-lessons that take five to ten minutes and emphasize speaking, listening, and active recall. Vocabulary is introduced contextually with example sentences, and core grammar points are taught through interactive mini-exercises rather than long lectures. A speech recognition engine gives immediate, constructive feedback on pronunciation and fluency. LearnLang integrates spaced repetition for vocabulary review so that learners see words right before they are likely to forget them, which drastically improves retention over passive review. Each user receives a personalized study path based on baseline assessment and goals (travel, work, exam prep), and the system adapts difficulty and pacing as performance changes. The app includes cultural notes and short reading passages to build comprehension and cultural literacy. Social features include optional language partner matching and community challenges for motivation. Offline packs make it possible to study while traveling without connectivity. For institutions there are classroom features for assignments and progress tracking. Privacy is respected: speech data is processed transiently for feedback and not retained without consent. Monetization mixes a robust free tier with subscription options unlocking advanced grammar modules, unlimited offline packs, and tutor matchmaking. LearnLang is aimed at learners who prefer incremental, practical progress and want reliable tools that translate study into real conversational ability.",
    "size": 44,
    "reviews": 18000,
    "ratingAvg": 4.6,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 10700 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/taxi.png",
    "title": "RideNow",
    "companyName": "Urban Mobility",
    "id": 6,
    "description": "RideNow is a ride-hailing and local mobility app focused on efficient city travel and safety. The app connects riders to nearby drivers, provides ETA predictions, and supplies live tracking while offering upfront pricing and multiple ride options (shared, private, XL). Integrated route optimization helps drivers reduce idle time and riders experience shorter wait times. Safety features include driver verification, trip-sharing with trusted contacts, an in-app emergency button, and a post-trip driver rating system. RideNow offers accessibility options including wheelchair-accessible vehicle requests and voice-guided trip updates. For frequent riders, the app supports passes and subscriptions with discounted rides and priority pickups in busy periods. Integration with public transit schedules gives multi-modal trip planning that blends rides with buses and trains for cost-effective commutes. Drivers have a dedicated app with earnings summaries, mapped incentives, and simple navigation. RideNow’s payments support multiple methods including card, mobile wallets, and corporate billing. Environmental options let riders choose low-emission vehicle types where available. The app emphasizes transparent fees and customer support channels with clear escalation paths. RideNow’s business model mixes commissions and subscription products for enterprise clients that need employee mobility solutions. With robust localization and multi-currency support, RideNow can be adapted to mid-size and large cities looking for flexible, rider-first mobility solutions.",
    "size": 36,
    "reviews": 30000,
    "ratingAvg": 4.1,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 9500 }
    ]
  },
  {
    "image": "https://cdn-icons-png.freepik.com/512/5222/5222787.png",
    "title": "CookBook+",
    "companyName": "KitchenTech",
    "id": 7,
    "description": "CookBook+ is a culinary companion that streamlines recipe discovery, meal planning, and grocery management so home cooks spend less time researching and more time enjoying meals. The app aggregates recipes from trusted creators and presents them in a standardized, easy-to-follow format, with step timers, adjustable serving sizes, and integrated shopping lists. Users can save recipes into collections, tag them with dietary labels, and build repeatable weekly meal plans that automatically generate consolidated grocery lists. The shopping list supports aisle grouping, barcode scanning to add items, and coupons or discounts provided by partner stores. A guided cook mode offers step-by-step instructions with photos or short video clips, hands-free navigation, and voice prompts so users don’t touch the screen with messy hands. CookBook+ includes a pantry tracker that remembers what users already have and reduces food waste by suggesting recipes based on expiring ingredients. For social sharing there are family recipe collections with permissioned editing and a cook-time scheduler so family meals are coordinated. Advanced users can convert recipes to shopping orders or export nutrition breakdowns per recipe. The free tier includes recipe browsing and basic lists; a premium subscription adds meal planning automation, exclusive chef content, and integration with grocery delivery services. The app is designed for beginners and seasoned home cooks who want to simplify meal prep and reduce decision fatigue while exploring new flavors.",
    "size": 40,
    "reviews": 11000,
    "ratingAvg": 4.4,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5300 }
    ]
  },
  {
    "image": "https://img.freepik.com/free-vector/international-yoga-day-particle-style-woman-doing-lotus-asana_1017-52611.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "MindSpace",
    "companyName": "CalmTech",
    "id": 8,
    "description": "MindSpace is a mental wellness and mindfulness app that offers guided meditations, breathing exercises, sleep stories, and habit-building tools designed to reduce stress and improve daily focus. The app’s library ranges from short two-minute grounding sessions to longer guided meditations targeting anxiety, sleep, and concentration. MindSpace uses evidence-based techniques and partners with clinicians to produce safe, effective sessions. The app adapts recommendations based on user input and recent engagement, offering micro-practices that fit commutes, breaks, or the end of the day. A sleep suite includes ambient soundscapes, narrated stories, and gentle wind-down routines engineered to lower physiological arousal and support sleep onset. Habit tracking helps users build consistent mindfulness practice through streaks, reminders, and reflective prompts that encourage noticing progress beyond raw completion metrics. MindSpace highlights inclusivity with content for different faiths and cultural contexts and provides accessibility features like captions, adjustable narration speed, and a visual mode for focused breath exercises. For organizations MindSpace offers curated programs and analytics to monitor usage and well-being trends while preserving personal privacy. The app’s free tier has many introductory sessions; the subscription unlocks the full content library, multi-device sync, and offline downloads. MindSpace aims to be a practical daily tool for people seeking calmer moments and improved emotional regulation without requiring clinical treatment.",
    "size": 26,
    "reviews": 9000,
    "ratingAvg": 4.8,
    "downloads": 700000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 5600 }
    ]
  },
  {
    "image": "https://img.icons8.com/fluency/256/news.png",
    "title": "NewsFlash",
    "companyName": "InfoStream",
    "id": 9,
    "description": "NewsFlash is a personalized news aggregator designed to surface high-quality, balanced reporting while giving users control over topics, sources, and frequency. The app compiles headlines and long-form articles across categories like world, business, science, technology, and local news and allows users to curate their feed by favoriting sources or muting topics. NewsFlash emphasizes transparency by labeling source bias indicators, author information, and origins for aggregated articles, and provides options to follow story timelines with evolving updates. For readers who want digestible updates there are short daily briefings and audio read-aloud versions for commuters. The app includes advanced search and saved searches for monitoring specific topics and offers topic-based newsletters users can subscribe to. A highlight feature is contextual explainer cards that summarize complex issues with timelines and key players for quick orientation. Privacy-respecting personalization keeps most processing local while allowing synced preferences across devices with user consent. Journalism partnerships make it possible to surface premium investigative pieces while offering metered access or micropayments for single articles. NewsFlash supports community notes and corrections, enabling readers to add context or flagged inaccuracies in a crowdsourced model moderated by editorial partners. Notifications can be tailored aggressively for breaking events or muted for a low-disruption experience. NewsFlash is built for readers who want a more intentional and curated news diet aligned with their interests and time constraints.",
    "size": 30,
    "reviews": 15000,
    "ratingAvg": 4.0,
    "downloads": 850000,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 4800 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/controller.png",
    "title": "GameHub",
    "companyName": "PlayWorld",
    "id": 10,
    "description": "GameHub is a curated discovery and launcher app for mobile gamers that helps users find high-quality games, manage installations, and follow updates and events across titles. The app features editorial lists, personalized recommendations based on play style and installed games, and a lightweight launcher that aggregates achievements and cross-game friend lists. GameHub supports quick demos and trailers and displays key metadata like file size, controller support, and monetization model. Community features include event calendars, tournament listings, and user reviews that emphasize playability and fairness. For developers GameHub offers analytics dashboards and curated promotion opportunities to surface indie and high-potential titles. GameHub focuses on safe monetization by labeling in-app purchases and implementing recommended parental controls. The launcher optimizes device storage by offering cloud-backed backups and selective asset downloads so players can try games without committing to full installs. GameHub also highlights accessibility-forward features like remappable controls and contrast options. The platform supports multi-account management for families and provides a unified update center for installed games. GameHub’s revenue mixes affiliate distribution, optional subscriptions for premium discovery tools, and developer partnerships. The app is ideal for mobile gamers who want discovery without noise and developers aiming for curated exposure.",
    "size": 48,
    "reviews": 50000,
    "ratingAvg": 4.3,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 10000 },
      { "name": "4 star", "count": 15000 },
      { "name": "5 star", "count": 15000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/note.png",
    "title": "NoteSync",
    "companyName": "CloudWorks",
    "id": 11,
    "description": "NoteSync is a lightweight, fast note-taking app built for clarity and reliability. The app focuses on quick capture with a minimal friction interface: quick-add shortcuts, markdown-style formatting, and a powerful search that indexes content and tags for instant retrieval. Sync is optimized for low-bandwidth conditions using a compact change-sync protocol and conflict resolution that surfaces choices rather than silently overwriting content. NoteSync supports offline editing and resumes sync when connectivity returns, ensuring notes are not lost in transit. Organizational features include notebooks, nested tags, and pinning of important notes. The app supports rich media embedding (images, voice memos, and short attachments), with thumbnails and inline previews for faster browsing. For focused work there is a distraction-free writer mode and version history to roll back unintended edits. The app takes privacy seriously with optional end-to-end encrypted notebooks and local-first storage for users who prefer not to sync to cloud servers. Collaboration capabilities include shared read/write notebooks with change history and comments for lightweight team coordination. NoteSync offers export formats for markdown and PDF and includes integrations with calendar apps to turn notes into tasks. The core app is free; a subscription unlocks cross-device sync, larger storage, and advanced encryption controls. NoteSync is ideal for students, writers, and professionals who want a reliable, fast notes app that respects user data and scales with their workflow.",
    "size": 16,
    "reviews": 7000,
    "ratingAvg": 4.5,
    "downloads": 400000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 3200 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/vibrant-yellow-suitcase-adorned-with-stylish-straw-hat-seashell-symbolizing-fun-relaxing-beach-getaway-perfect-summer-travel-enthusiasts_444390-25741.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "TravelMate",
    "companyName": "GlobeTrotters",
    "id": 12,
    "description": "TravelMate is a trip planning and discovery tool that brings itinerary building, reservations, and local exploration into a single mobile experience. The app helps users research destinations, discover points of interest, and plan day-by-day itineraries with time estimates and transit suggestions. Integrated booking capabilities include hotels, experiences, and transport, with consolidated itineraries and reminders that sync to calendar apps. TravelMate helps optimize routes to minimize transit time and maximize sightseeing, and it offers offline maps and downloadable city guides so travelers can stay productive even without connectivity. The app provides local tips curated by experienced travelers including cultural norms and budget-conscious food recommendations. Price-tracking tools alert users when flight or hotel prices dip, and a packing checklist adapts by destination and season. TravelMate supports multi-person trips with shared itineraries and comment threads for collaborative planning. Safety features include local emergency contacts, embassies, and easy document storage for copies of passports and reservations. The platform integrates user reviews with verified experiences and helps travelers balance popular attractions with lesser-known gems. TravelMate’s free tier covers planning and offline city guides, while premium features include fare alerts, concierge bookings, and advanced itinerary analytics. The app is designed for frequent travelers and casual vacationers alike who want a single companion that reduces friction from research to return home.",
    "size": 42,
    "reviews": 12500,
    "ratingAvg": 4.4,
    "downloads": 920000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 4200 }
    ]
  },
   {
    "image": "https://img.icons8.com/color/256/yoga.png",
    "title": "YogaFlow",
    "companyName": "Wellness Co.",
    "id": 13,
    "description": "YogaFlow is a guided yoga and flexibility app offering sessions for all skill levels. The app includes morning energizers, evening stretches, meditation integration, and posture alignment checks via the camera. It tracks progress, recommends routines based on flexibility and stamina, and includes mindfulness audio cues. YogaFlow also supports custom sequences and offline mode for uninterrupted practice. The subscription unlocks advanced tutorials, live classes, and personalized plans.",
    "size": 28,
    "reviews": 8200,
    "ratingAvg": 4.7,
    "downloads": 600000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 2800 },
      { "name": "5 star", "count": 3850 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/musical-notes.png",
    "title": "TuneStream",
    "companyName": "SoundLabs",
    "id": 14,
    "description": "TuneStream is a music streaming app that provides personalized playlists, offline downloads, high-fidelity audio, and curated radio stations. Users can explore trending genres, follow artists, and share playlists with friends. Advanced recommendation algorithms learn from listening patterns, while the premium tier removes ads, unlocks unlimited skips, and supports offline high-quality playback.",
    "size": 60,
    "reviews": 45000,
    "ratingAvg": 4.6,
    "downloads": 9000000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 22000 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/shopping-cart--v1.png",
    "title": "CartEase",
    "companyName": "ShopTech",
    "id": 15,
    "description": "CartEase is a smart shopping app that simplifies browsing, comparing prices, and managing online purchases. Users can scan barcodes, create wishlists, track orders, and receive alerts for discounts. Advanced AI recommendations suggest products based on preferences and past shopping behavior. CartEase premium provides early access to deals, loyalty rewards, and multi-store integration.",
    "size": 75,
    "reviews": 38000,
    "ratingAvg": 4.3,
    "downloads": 8500000,
    "ratings": [
      { "name": "1 star", "count": 2500 },
      { "name": "2 star", "count": 3200 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 12000 },
      { "name": "5 star", "count": 13300 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/partly-cloudy-day--v1.png",
    "title": "WeatherEye",
    "companyName": "ClimateTech",
    "id": 16,
    "description": "WeatherEye provides real-time weather forecasts, radar maps, severe weather alerts, and air quality monitoring. The app allows users to track multiple locations, view hourly and weekly forecasts, and customize notifications for specific weather events. Premium subscribers gain access to long-term climate analytics, storm tracking, and ad-free experience.",
    "size": 25,
    "reviews": 12000,
    "ratingAvg": 4.4,
    "downloads": 2000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 4700 }
    ]
  },
 
  
  {
    "image": "https://img.icons8.com/color/256/calendar-1.png",
    "title": "PlanIt",
    "companyName": "NextGen Apps",
    "id": 17,
    "description": "PlanIt is a planning and calendar app that helps users schedule events, manage tasks, and coordinate with teams. Smart notifications, recurring event handling, and integration with email and productivity apps allow seamless workflow management. Premium unlocks shared team calendars, advanced analytics, and priority support.",
    "size": 20,
    "reviews": 14000,
    "ratingAvg": 4.6,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 6600 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/health-book.png",
    "title": "MediTrack",
    "companyName": "HealthTech",
    "id": 18,
    "description": "MediTrack allows users to log medications, set reminders, track symptoms, and manage health records. The app offers integration with wearable devices and electronic medical records for a holistic view. Premium users access multi-user tracking, advanced analytics, and exportable reports for healthcare consultations.",
    "size": 32,
    "reviews": 10000,
    "ratingAvg": 4.4,
    "downloads": 700000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 4700 }
    ]
  },
  {
    "image": "https://img.icons8.com/color/256/chat.png",
    "title": "ChatWave",
    "companyName": "ComTech",
    "id": 19,
    "description": "ChatWave is a messaging platform with group and direct chat, voice and video calls, and media sharing. End-to-end encryption ensures privacy. Advanced search, threaded messages, and custom notifications enhance communication. Premium subscription provides larger file transfers, priority support, and multi-device sync.",
    "size": 26,
    "reviews": 35000,
    "ratingAvg": 4.5,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 11000 },
      { "name": "5 star", "count": 14500 }
    ]
  }
  
]